app/Services/CartService.php

SELECT *
FROM `carts`
WHERE `session_id` = 'k1t93uu99ev926v0lqivck4lfqn42fih'
 LIMIT 1
---
    private function getCart()
    {
        $session = session();

        $user = $session->get('user');
        $userId = 0;

        if ($user && isset($user['isLoggedIn']) && $user['isLoggedIn'] === true) {
            $userId = $user['userId']; // use 'id' not userId
        }

        $sessionId = $this->getCartSessionId();

        if ($userId) {
            $this->mergeCartAfterLogin();
            $cart = $this->cartModel->where('user_id', $userId)->first();
            if ($cart) {
                return $cart;
            }
        }

        return $this->cartModel->where('session_id', $sessionId)->first();

SELECT *
FROM `cart_items`
WHERE `cart_id` = '114'
SELECT *
FROM `categories`
WHERE `id` IN ('17','19')
---
    public function getCartItems()
    {
        $cart = $this->getCart();
        if (!$cart) {
            return [];
        }

        $items = $this->itemModel->where('cart_id', $cart['id'])->findAll();

        if (empty($items)) {
            return [];
        }
        // Products
        $productIds = array_column($items, 'product_id');
        if (empty($productIds)) {
            return [];
        }

        $products = $this->productManageModel->whereIn('id', $productIds)->findAll();
        $products = array_column($products, null, 'id');

        // Categories
        $categoryIds = array_unique(array_column($products, 'category_id'));

        if (!empty($categoryIds)) {
            $categories = $this->categoryModel
                ->whereIn('id', $categoryIds)
                ->findAll();

SELECT `cust_datas`
FROM `cart_item_customizations`
WHERE `cart_item_id` = '179'
 LIMIT 1
---
                'quantity'      => $item['quantity'],
                'subtotal'      => $item['subtotal'],
                'image'         => $product['product_image'],
                'info'          => $this->cartItemCustomizationModel->select('cust_datas')->where('cart_item_id', $item['id'])->first()