app/Services/ProductService.php

SELECT *
FROM `product_sizes`
WHERE `id` = '61'
---
    private function productSize($sizeId){
        $size = $this->productSizeModel->where('id', $sizeId)->get()->getRowArray();

SELECT *
FROM `product_addons`
WHERE `id` IN ('56')
---
    private function productAddons($addonIds){
        $addons = $this->productAddonModel->whereIn('id', $addonIds)->get()->getResultArray();