app/Controllers/admin/productmanagementController.php

    public function index()
    {
       $page = (haspermission('','product_management')) ? ucwords(getappdata('product_management')) : lang('Custom.permissiondenied');
       $route = (haspermission('','product_management')) ? 'admin/productmanagement/index' : 'admin/pages-error-404';
       $categories = $this->categoryModel->where('is_active',1)->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1

    public function getProductBycategory($id=false) {
        $validStatus = false;
        $validMsg    = '';
        $validResult = '';

        if(!$this->request->isAJAX()) {
            $validMsg = lang('Custom.invalidRequest');
        }
        if(!haspermission('','product_management')) {
             $validMsg = lang('Custom.permissiondenied');
        }else{

           $products = $this->productModel->select('id,product_name')->where('category_id', $id)->where('current_stock >', 0)->where('status', 1)->findAll();
---
SELECT `id`, `product_name`
FROM `products`
WHERE `category_id` = '18'
AND `current_stock` > 0
AND `status` = 1


            $colorIds = $this->request->getPost('color_id')?? [];
            $colorImages   = $this->request->getFiles()['colors_image'] ?? [];
            $existingcolourIds  = $this->productColorModel->where('product_id', $id)->findColumn('id');
---
SELECT `id`
FROM `product_colors`
WHERE `product_id` = '31'

         // close Colour
        // Open addon
        $addonIds = $this->request->getPost('addon_id')?? [];
        $existingAddonIds  = $this->productaddonModel->where('product_id', $id)->findColumn('id');
---
SELECT `id`
FROM `product_addons`
WHERE `product_id` = '31'

                ];

                if(!empty($addonIds[$index])){
                     $this->productaddonModel->update($addonIds[$index], $addOndatas);
---
UPDATE `product_addons` SET `product_id` = '31', `addon_name` = 'IP67 Rated Waterproof Tech', `addon_price` = '3000.00', `description` = ''
WHERE `product_addons`.`id` IN ('55')

             if(!empty($uploadedPaths)) {
                foreach ($uploadedPaths as $url) {

                        $this->productvariantImagesModel->insert(['product_id'=> $id,'image' => str_replace(base_url(),'',$url)]);
---
INSERT INTO `product_variant_images` (`product_id`, `image`) VALUES ('31', 'uploads/products/1778842406_6a06fb26271ef.webp')

            }

            // product size
            $product[$productId]['product_size'] = $this->sizeChartModel->where('product_id',$productId)->findAll();
            // product color
            $product[$productId]['product_color'] = $this->productColorModel->where('product_id',$productId)->findAll();
            // product addon
            $product[$productId]['product_addon'] = $this->productaddonModel->where('product_id',$productId)->findAll();
---
SELECT *
FROM `product_sizes`
WHERE `product_id` = '31'
SELECT *
FROM `product_colors`
WHERE `product_id` = '31'
SELECT *
FROM `product_addons`
WHERE `product_id` = '31'