app/Helpers/common_helper.php

SELECT *
FROM `categories`
WHERE `is_active` = 1
AND `parent_id` IS NULL
---
    function services() {
        $categoryModel = new CategoryModel();
        $services = $categoryModel->where(['is_active'=>1,'parent_id' =>NULL])->findAll();