app/Controllers/HomeController.php

SELECT *
FROM `slider`
WHERE `status` = 1
ORDER BY `id` DESC
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `id` DESC
SELECT *
FROM `expertise`
WHERE `status` = 1
ORDER BY `title` ASC
SELECT *
FROM `feedback`
WHERE `status` = 1
ORDER BY `id` DESC
SELECT *
FROM `news`
WHERE `status` = 1
ORDER BY `id` DESC
 LIMIT 3
---
    public function index() {
        helper('text');
        $page = 'Home';
        $banner = $this->sliderModel->where(['status' => 1 ])->orderBy('id','DESC')->get()->getResult();
        $itemCategories = $this->categoryModel->where(['is_active' => 1])->orderBy('id','DESC')->get()->getResult();
        $premiumProducts = $this->productManageModel->where(['product_status' => 1,'premium_product' =>1])->orderBy('id','DESC')->limit(10)->get()->getResult();
        $featuredProducts = $this->productManageModel->where(['product_status' => 1,'featured_product' =>1])->orderBy('id','DESC')->limit(10)->get()->getResult();
        $latestProducts = $this->productManageModel->where(['product_status' => 1,'latest_product' =>1])->orderBy('id','DESC')->limit(10)->get()->getResult();
        $tagline = $this->expertiseModel->where(['status' => 1])->orderBy('title','ASC')->get()->getResult();
        $feedback = $this->feedbackModel->where(['status' => 1])->orderBy('id','DESC')->get()->getResult();
        $news  = $this->newsModel->where(['status' => 1])->orderBy('id','DESC')->limit(3)->get()->getResult();