app/Controllers/ProductController.php

    public function singleDetails($slug=false) {
        if(empty($slug)) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $product = $this->productModel->where(['product_status' => 1,'slug'=>$slug])->first();
        if(empty($product)) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $page = "Products";
        $pageTitle = $product['product_title'];
        // product size
        $productSize = $this->productSizeModel->where(['product_id' => $product['id']])->findAll();
        // product addon
        $productAddon = $this->productAddonModel->where(['product_id' => $product['id']])->findAll();
        // product color
        $productColor = $this->productColorModel->where(['product_id' => $product['id']])->findAll();
        // product variant images
        $productVariantImages = $this->productVariantImagesModel->where(['product_id' => $product['id']])->findAll();
        //product fonts
        $productFonts = $this->productFontsModel->where(['product_id' => $product['id']])->findAll();
---
SELECT *
FROM `product_sizes`
WHERE `product_id` = '36'
SELECT *
FROM `product_addons`
WHERE `product_id` = '36'
SELECT *
FROM `product_colors`
WHERE `product_id` = '36'
SELECT *
FROM `product_variant_images`
WHERE `product_id` = '36'
SELECT *
FROM `product_fonts`
WHERE `product_id` = '36'