app/Models/ProductManageModel.php

SELECT *
FROM `product_management`
WHERE `product_status` = 1
---
    function getData($search='',$filter=false){
        $builder = $this->table('product_management');
        $builder->where('product_status', 1);
        if($search) {
            $builder->like('product_title', $search);
        }
        if($filter && $filter != 'all') {
            $builder->where('product_status', $filter);
        }
        return $builder->findAll();